print('Задача 4. Площадь треугольника')

# Напишите программу,
# которая запрашивает у пользователя длины двух катетов
# в прямоугольном треугольнике и выводит его площадь.

# Формула:
# S = ab/2

a = int(input('Катит 1 = '))
b = int(input('Катит 2 = '))
print('S = ', ((a * b)/2))