#Напишите программу, которая выводит такое «окно» на экран.

#Размер окна может быть любым, 
#вместо слова «друг» можете написать своё имя.
#Постарайтесь добиться результата из третьего варианта.
print('Задание 2.')

#print('Первый вариант')
print('==============================')
print('Привет')
print('друг')
print('==============================')

#print('Второй вариант')
print('==============================')
print('||        Привет            ||')
print('||         друг             ||')
print('==============================')

#print('Третий вариант')
print('==============================')
print('||                          ||')
print('||                          ||')
print('||          Привет,         ||')
print('||          Сергей!         ||')
print('||                          ||')
print('||                          ||')
print('==============================')
